#include "DetermineCalc.h"

/******************************************
*		Функція обчислення визначника	  *
*	Параметри:							  *
*	matrix - матриця для якої потірбно	  *
*		  порахувати визначник			  *
*	n - розмірність матриці				  *
******************************************/
int det(const int** matrix, int n){
	int determine = 0; // Визначник матриці matrix

	// Якщо розмірність матриці відмінна від одиниці
	if (n != 1) {
		// То, обчислюємо визначник розкладном за першим стовпцем (як сума алгебраїчних доповнень до 1-го рядка)
		for (int z = 0; z < n; z++) determine += AlgebralAdditionCalc(matrix, n, z);
	}
	// Інакше повернути визначник матриці 1х1
	else return matrix[0][0];
}

/******************************************
*		Функція обчислення алгебраїчного  *
*		мінору заданого елементу		  *
*	Параметри:							  *
*	matrix - матриця для якої потірбно	  *
*		  алгебраїний мінор				  *
*	n - розмірність матриці				  *
*	y - номер стовпця елемента, для		  *
*		якого потрібно порахувати		  *
*		алгебраїний мінор				  *
******************************************/
int AlgebralMinorCalc(const int const** matrix, const int& n, const int& y) {
	return det(matrixCut(matrix, n, y), n - 1);
}
int AlgebralAdditionCalc(const int const**, const int&, const int&); // Обчислення алгебраїного доповнення заданого елементу